; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p9---int100n150-m25---int100c150---s350---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level6 level69)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level6 level70)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level6 level71)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level6 level72)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level6 level73)
(sum level67 level13 level80)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level68 level6 level74)
(sum level68 level13 level81)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level69 level3 level72)
(sum level69 level4 level73)
(sum level69 level6 level75)
(sum level69 level13 level82)
(sum level69 level14 level83)
(sum level69 level16 level85)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level70 level3 level73)
(sum level70 level4 level74)
(sum level70 level6 level76)
(sum level70 level13 level83)
(sum level70 level14 level84)
(sum level70 level16 level86)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level71 level3 level74)
(sum level71 level4 level75)
(sum level71 level6 level77)
(sum level71 level13 level84)
(sum level71 level14 level85)
(sum level71 level16 level87)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level72 level3 level75)
(sum level72 level4 level76)
(sum level72 level6 level78)
(sum level72 level13 level85)
(sum level72 level14 level86)
(sum level72 level16 level88)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level73 level3 level76)
(sum level73 level4 level77)
(sum level73 level6 level79)
(sum level73 level13 level86)
(sum level73 level14 level87)
(sum level73 level16 level89)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level74 level3 level77)
(sum level74 level4 level78)
(sum level74 level6 level80)
(sum level74 level13 level87)
(sum level74 level14 level88)
(sum level74 level16 level90)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level75 level3 level78)
(sum level75 level4 level79)
(sum level75 level6 level81)
(sum level75 level13 level88)
(sum level75 level14 level89)
(sum level75 level16 level91)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level76 level3 level79)
(sum level76 level4 level80)
(sum level76 level6 level82)
(sum level76 level13 level89)
(sum level76 level14 level90)
(sum level76 level16 level92)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level77 level3 level80)
(sum level77 level4 level81)
(sum level77 level6 level83)
(sum level77 level13 level90)
(sum level77 level14 level91)
(sum level77 level16 level93)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level78 level3 level81)
(sum level78 level4 level82)
(sum level78 level6 level84)
(sum level78 level13 level91)
(sum level78 level14 level92)
(sum level78 level16 level94)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level79 level3 level82)
(sum level79 level4 level83)
(sum level79 level6 level85)
(sum level79 level13 level92)
(sum level79 level14 level93)
(sum level79 level16 level95)
(sum level79 level23 level102)
(sum level80 level3 level83)
(sum level80 level4 level84)
(sum level80 level6 level86)
(sum level80 level13 level93)
(sum level80 level14 level94)
(sum level80 level16 level96)
(sum level81 level3 level84)
(sum level81 level4 level85)
(sum level81 level6 level87)
(sum level81 level13 level94)
(sum level81 level14 level95)
(sum level81 level16 level97)
(sum level82 level3 level85)
(sum level82 level4 level86)
(sum level82 level6 level88)
(sum level82 level13 level95)
(sum level82 level14 level96)
(sum level82 level16 level98)
(sum level83 level3 level86)
(sum level83 level4 level87)
(sum level83 level6 level89)
(sum level83 level13 level96)
(sum level83 level14 level97)
(sum level83 level16 level99)
(sum level84 level3 level87)
(sum level84 level4 level88)
(sum level84 level6 level90)
(sum level84 level13 level97)
(sum level84 level14 level98)
(sum level84 level16 level100)
(sum level85 level3 level88)
(sum level85 level4 level89)
(sum level85 level6 level91)
(sum level85 level13 level98)
(sum level85 level14 level99)
(sum level85 level16 level101)
(sum level86 level3 level89)
(sum level86 level4 level90)
(sum level86 level6 level92)
(sum level86 level13 level99)
(sum level86 level14 level100)
(sum level86 level16 level102)
(sum level87 level3 level90)
(sum level87 level4 level91)
(sum level87 level6 level93)
(sum level87 level13 level100)
(sum level87 level14 level101)
(sum level88 level3 level91)
(sum level88 level4 level92)
(sum level88 level6 level94)
(sum level88 level13 level101)
(sum level88 level14 level102)
(sum level89 level3 level92)
(sum level89 level4 level93)
(sum level89 level6 level95)
(sum level89 level13 level102)
(sum level90 level3 level93)
(sum level90 level4 level94)
(sum level90 level6 level96)
(sum level91 level3 level94)
(sum level91 level4 level95)
(sum level91 level6 level97)
(sum level92 level3 level95)
(sum level92 level4 level96)
(sum level92 level6 level98)
(sum level93 level3 level96)
(sum level93 level4 level97)
(sum level93 level6 level99)
(sum level94 level3 level97)
(sum level94 level4 level98)
(sum level94 level6 level100)
(sum level95 level3 level98)
(sum level95 level4 level99)
(sum level95 level6 level101)
(sum level96 level3 level99)
(sum level96 level4 level100)
(sum level96 level6 level102)
(sum level97 level3 level100)
(sum level97 level4 level101)
(sum level98 level3 level101)
(sum level98 level4 level102)
(sum level99 level3 level102)

(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l0 l4)
(fuelcost level24 l0 l4)
(connected l0 l5)
(fuelcost level16 l0 l5)
(connected l1 l2)
(fuelcost level3 l1 l2)
(connected l1 l3)
(fuelcost level4 l1 l3)
(connected l1 l4)
(fuelcost level13 l1 l4)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level3 l2 l1)
(connected l2 l5)
(fuelcost level6 l2 l5)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l1)
(fuelcost level4 l3 l1)
(connected l4 l0)
(fuelcost level24 l4 l0)
(connected l4 l1)
(fuelcost level13 l4 l1)
(connected l4 l5)
(fuelcost level14 l4 l5)
(connected l5 l0)
(fuelcost level16 l5 l0)
(connected l5 l2)
(fuelcost level6 l5 l2)
(connected l5 l4)
(fuelcost level14 l5 l4)

(at t0 l5)
(fuel t0 level102)
(= (total-cost) 0)

(at p0 l4)
(at p1 l5)
(at p2 l3)
(at p3 l5)
(at p4 l1)
(at p5 l1)
(at p6 l5)
(at p7 l1)
(at p8 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l4)
(at p2 l4)
(at p3 l0)
(at p4 l3)
(at p5 l5)
(at p6 l2)
(at p7 l2)
(at p8 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l5)
   deleted: (at p6 l5)
   added: (in p6 t0)
   goals met: 0 of 9
2. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 9
3. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 0 of 9
4. (drive t0 l5 l4 level88 level14 level102)
   deleted: (at t0 l5) (fuel t0 level102)
   added: (at t0 l4) (fuel t0 level88)
   goals met: 0 of 9
5. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 9
6. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 1 of 9
7. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 1 of 9
8. (drive t0 l4 l1 level75 level13 level88)
   deleted: (at t0 l4) (fuel t0 level88)
   added: (at t0 l1) (fuel t0 level75)
   goals met: 1 of 9
9. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 9
10. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 2 of 9
11. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 2 of 9
12. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 2 of 9
13. (drive t0 l1 l3 level71 level4 level75)
   deleted: (at t0 l1) (fuel t0 level75)
   added: (at t0 l3) (fuel t0 level71)
   goals met: 2 of 9
14. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 2 of 9
15. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 3 of 9
16. (drive t0 l3 l0 level47 level24 level71)
   deleted: (at t0 l3) (fuel t0 level71)
   added: (at t0 l0) (fuel t0 level47)
   goals met: 3 of 9
17. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 4 of 9
18. (drive t0 l0 l2 level24 level23 level47)
   deleted: (at t0 l0) (fuel t0 level47)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 4 of 9
19. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 5 of 9
20. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 6 of 9
21. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 7 of 9
22. (drive t0 l2 l5 level18 level6 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l5) (fuel t0 level18)
   goals met: 7 of 9
23. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 8 of 9
24. (drive t0 l5 l4 level4 level14 level18)
   deleted: (at t0 l5) (fuel t0 level18)
   added: (at t0 l4) (fuel t0 level4)
   goals met: 8 of 9
25. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 9 of 9
